In [7]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt

from sqlalchemy import create_engine

In [3]:
#1) 
engine = create_engine('postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind')

In [8]:
#2) psycopg2
import psycopg2  

params = {
  'dbname': 'northwind',
  'user': 'dsi_student',
  'password': 'gastudents',
  'host': 'dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com',
  'port': 5432
}

conn = psycopg2.connect(**params)

In [10]:
pd.read_sql_query('SELECT table_name FROM information_schema.tables;',con=conn).head()

   table_name
0     pg_type
1  categories
2    pg_roles
3    pg_group
4     pg_user

In [11]:
pd.read_sql_query('SELECT * FROM Customers LIMIT 100;',
                  con=conn).head()

,CustomerID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,None,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,None,05021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,None,05023,Mexico,(5) 555-3932,None
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,None,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,None,S-958 22,Sweden,0921-12 34 65,0921-12 34 67

In [12]:
pd.read_sql_query('SELECT orders."OrderID", customers."CompanyName", orders."OrderDate"\
    FROM orders\
    INNER JOIN customers\
    ON orders."CustomerID" = customers."CustomerID";', con=conn).head()

   OrderID                CompanyName   OrderDate
0    10248  Vins et alcools Chevalier  1996-07-04
1    10249         Toms Spezialitäten  1996-07-05
2    10250              Hanari Carnes  1996-07-08
3    10251       Victuailles en stock  1996-07-08
4    10252           Suprêmes délices  1996-07-09

In [13]:
pd.read_sql_query('SELECT count(*)\
    FROM orders\
    FULL JOIN customers\
    ON orders."CustomerID" = customers."CustomerID";', con=conn).head()

   count
0    832

In [ ]:
#   SELECT COUNT(*)
#     FROM orders
#     FULL OUTER JOIN customers
#     ON orders."CustomerID"=customers."CustomerID";

In [ ]:
# SELECT c."CustomerID",
#      CAST(
#      SUM("UnitPrice" *  "Quantity" * 1.0 - "Discount")) AS numeric(36,2)) AS "Revenue"
# FROM customers AS c
# JOIN orders AS o
# ON c."CustomerID" = o."CustomerID"
# JOIN order_details AS od
# ON o."OrderID" = od."OrderID"
# GROUP BY c."CustomerID"
# ORDER BY "Revenue" DESC
# LIMIT 5

In [ ]:
# CAST (SUM_A) AS NUMERIC